In [1]:
import pandas as pd
import matplotlib.pyplot as plt 
from sqlalchemy import create_engine

In [3]:

engine = create_engine('postgresql://databaseandpassword@localhost:5432/employee_DB')
connection = engine.connect()

In [24]:
employee = pd.read_sql("SELECT * FROM employees",connection)
salary = pd.read_sql("SELECT * FROM salaries",connection)
title = pd.read_sql("SELECT * FROM titles",connection)

In [9]:
data

        emp_no emp_title  birth_date   first_name  last_name sex   hire_date
0       473302     s0001  1953-07-25     Hideyuki   Zallocco   M  1990-04-28
1       475053     e0002  1954-11-18        Byong  Delgrande   F  1991-09-07
2        57444     e0002  1958-01-30        Berry       Babb   F  1992-03-21
3       421786     s0001  1957-09-28        Xiong   Verhoeff   M  1987-11-26
4       282238     e0003  1952-10-28   Abdelkader    Baumann   F  1991-01-18
...        ...       ...         ...          ...        ...  ..         ...
300019  464231     s0001  1958-08-14  Constantino    Eastman   M  1988-10-28
300020  255832     e0002  1955-05-08       Yuping     Dayang   F  1995-02-26
300021   76671     s0001  1959-06-09       Ortrud   Plessier   M  1988-02-24
300022  264920     s0001  1959-09-22        Percy   Samarati   F  1994-09-08
300023  464503     s0002  1964-05-31       Arvind  Slobodova   M  1987-11-23

[300024 rows x 7 columns]

In [12]:
salary

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]

In [14]:
merge_data = pd.merge(data,salary,on="emp_no")

In [15]:
merge_data

,emp_no,emp_title,birth_date,first_name,last_name,sex,hire_date,salary
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000
1,475053,e0002,1954-11-18,Byong,Delgrande,F,1991-09-07,53422
2,57444,e0002,1958-01-30,Berry,Babb,F,1992-03-21,48973
3,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000
4,282238,e0003,1952-10-28,Abdelkader,Baumann,F,1991-01-18,40000
...,...,...,...,...,...,...,...,...
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28,69696
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26,75355
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24,61886
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08,62772
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23,41708

In [40]:
titles=title.rename(columns={"title_id":"emp_title"})
titles

  emp_title               title
0     s0001               Staff
1     s0002        Senior Staff
2     e0001  Assistant Engineer
3     e0002            Engineer
4     e0003     Senior Engineer
5     e0004    Technique Leader
6     m0001             Manager

In [41]:
title_salary = pd.merge(merge_data,titles,on="emp_title")
title_salary

,emp_no,emp_title,birth_date,first_name,last_name,sex,hire_date,salary,title
0,473302,s0001,1953-07-25,Hideyuki,Zallocco,M,1990-04-28,40000,Staff
1,421786,s0001,1957-09-28,Xiong,Verhoeff,M,1987-11-26,40000,Staff
2,273487,s0001,1957-04-14,Christoph,Parfitt,M,1991-06-28,56087,Staff
3,246449,s0001,1958-03-23,Subbu,Bultermann,F,1988-03-25,87084,Staff
4,48085,s0001,1964-01-19,Venkatesan,Gilg,M,1993-06-28,63016,Staff
...,...,...,...,...,...,...,...,...,...
300019,111400,m0001,1959-11-09,Arie,Staelin,M,1985-01-01,72446,Manager
300020,111133,m0001,1955-03-16,Hauke,Zhang,M,1986-12-30,71148,Manager
300021,110085,m0001,1959-10-28,Ebru,Alpin,M,1985-01-01,60026,Manager
300022,110386,m0001,1953-10-04,Shem,Kieras,M,1988-10-14,40000,Manager
300023,111784,m0001,1956-06-14,Marjo,Giarratana,F,1988-02-12,40000,Manager

In [ ]:
plt.bar(merge_data["last_name"],merge_data["salary"])

plt.show()